/*final version*/
#pragma
#include<iostream>
#include "singer.h"
using namespace std;

/*主函数调用的入口*/
int main()
{
	/*系统的总开关*/
	bool system_key = 1;//避免直接使用exit(0)

	/*一些最基本的底层信息*/
	int n = 10;//总选手人数,默认为10人
	int m = 0;//增加的人数
	int judge_num = 10;	//裁判数量
	Judge judges[10];	//十个裁判默认生成

	/*十个默认选手的十个成绩*/
	float scr_1[10] = { 10,10,10,10,10,10,10,10,10,10 };
	float scr_2[10] = { 10,10,10,10,10,10,10,10,10,10 };
	float scr_3[10] = { 10,8,10,10,10,10,10,7,10,10 };
	float scr_4[10] = { 10,8,10,5,10,5,10,7,10,10 };
	float scr_5[10] = { 10,8,10,5,10,5,10,7,10,10 };
	float scr_6[10] = { 9,8,9,5,9,5,9,7,9,9 };
	float scr_7[10] = { 1,2,3,4,5,6,7,8,9,10 };
	float scr_8[10] = { 0,1,1,1,1,1,1,1,1,1 };
	float scr_9[10] = { 2,3,3,4,1,4,5,1,2,2 };
	float scr_10[10] = { 1,3,7,0,10,3,6,7,4,5 };

	/*默认对象初始化*/
	Singer singers[10] =
	{

		{scr_1,1001,(char*)"张三",10,10,100,80,10},
		{scr_2,1003,(char*)"王五",10,10,100,80,10},
		{scr_3,1004,(char*)"李四",10,7,95,78,9.75},
		{scr_4,1002,(char*)"赵六",10,5,85,70,8.75},
		{scr_5,1005,(char*)"孙一",10,5,85,70,8.75},
		{scr_6,1006,(char*)"钱七",9,5,79,64,8.00},
		{scr_7,1007,(char*)"Tom",10,1,55,44,5.50},
		{scr_8,1008,(char*)"Biden",1,0,9,8,1.00},
		{scr_9,1009,(char*)"Trump",5,1,27,21,2.625},
		{scr_10,1010,(char*)"Moss",10,0,46,36,4.50}
	};

	/*函数入口，所有功能的集成*/
	while (system_key)
	{
		menu(singers, judges, &n, &m, &judge_num, &system_key);
	}
	return 0;
}

/*改进：
1.程序的函数参数使用过少								已改正
2.可以改进的点：增加删除、修改功能以及多文件			已改正
代码规范性 避免全局变量 函数参数的使用 输入界面美化简化	已改正

/*多文件*/
/*类*/
/*驼峰命名											已改正
/*case花括号											已改正
/*排序函数独立										已改正

/*多文件*/
//实现 cpp
//调用 main
//定义和声明 .h